## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.argocd.kubernetes_config_map.argocd_cm will be created
+   resource "kubernetes_config_map" "argocd_cm" {
+       data = {
+           "oidc.config"             = <<-EOT
                "clientID": "argocd"
                "clientSecret": "9UrDmHh$ejQp5j"
                "issuer": "https://accounts.google.com"
                "name": "ArgoCD"
                "requestedIDTokenClaims": {}
                "requestedScopes":
-                 "openid"
            EOT
+           "repositories"            = <<-EOT
-                 "name": "Helm-Main"
                  "type": "helm"
                  "url": "https://charts.helm.sh/stable"
            EOT
+           "repository.credentials"  = jsonencode([])
+           "resource.customizations" = <<-EOT
                argoproj.io/Application:
                      health.lua: |
                        hs = {}
                        hs.status = "Progressing"
                        hs.message = ""
                        if obj.status ~= nil then
                          if obj.status.health ~= nil then
                            hs.status = obj.status.health.status
                            if obj.status.health.message ~= nil then
                              hs.message = obj.status.health.message
                            end
                          end
                        end
                        return hs
                extensions/Ingress:
                    health.lua: |
                      hs = {}
                      hs.status = "Healthy"
                      return hs
                networking.k8s.io/Ingress:
                    health.lua: |
                      hs = {}
                      hs.status = "Healthy"
                      return hs
            EOT
+           "url"                     = "https://argocd.wayofthesys.org/"
        }
+       id   = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/name"    = "argocd-cm"
+               "app.kubernetes.io/part-of" = "argocd"
            }
+           name             = "argocd-cm"
+           namespace        = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.argocd.kubernetes_config_map.argocd_gpg_keys_cm will be created
+   resource "kubernetes_config_map" "argocd_gpg_keys_cm" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/name"    = "argocd-gpg-keys-cm"
+               "app.kubernetes.io/part-of" = "argocd"
            }
+           name             = "argocd-gpg-keys-cm"
+           namespace        = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.argocd.kubernetes_config_map.argocd_rbac_cm will be created
+   resource "kubernetes_config_map" "argocd_rbac_cm" {
+       data = {
+           "policy.csv" = <<-EOT
                # let members with group someProjectGroup handle apps in someProject
                # this can also be defined in the UI in the group-definition to avoid doing it there in the configmap
                p, someProjectGroup, applications, *, someProject/*, allow
                # let the group membership argocd-admins from OIDC become role:admin - needs to go into the configmap
                g, argocd-global-admins, role:admin
            EOT
+           "scopes"     = "[https://example.com/claims/groups, email]"
        }
+       id   = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/name"    = "argocd-rbac-cm"
+               "app.kubernetes.io/part-of" = "argocd"
            }
+           name             = "argocd-rbac-cm"
+           namespace        = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.argocd.kubernetes_config_map.argocd_redis_ha_configmap will be created
+   resource "kubernetes_config_map" "argocd_redis_ha_configmap" {
+       data = {
+           "haproxy.cfg"     = <<-EOT
                defaults REDIS
                  mode tcp
                  timeout connect 4s
                  timeout server 6m
                  timeout client 6m
                  timeout check 2s
                
                listen health_check_http_url
                  bind :8888
                  mode http
                  monitor-uri /healthz
                  option      dontlognull
                # Check Sentinel and whether they are nominated master
                backend check_if_redis_is_master_0
                  mode tcp
                  option tcp-check
                  tcp-check connect
                  tcp-check send PING\r\n
                  tcp-check expect string +PONG
                  tcp-check send SENTINEL\ get-master-addr-by-name\ argocd\r\n
                  tcp-check expect string REPLACE_ANNOUNCE0
                  tcp-check send QUIT\r\n
                  tcp-check expect string +OK
                  server R0 argocd-redis-ha-announce-0:26379 check inter 3s
                  server R1 argocd-redis-ha-announce-1:26379 check inter 3s
                  server R2 argocd-redis-ha-announce-2:26379 check inter 3s
                # Check Sentinel and whether they are nominated master
                backend check_if_redis_is_master_1
                  mode tcp
                  option tcp-check
                  tcp-check connect
                  tcp-check send PING\r\n
                  tcp-check expect string +PONG
                  tcp-check send SENTINEL\ get-master-addr-by-name\ argocd\r\n
                  tcp-check expect string REPLACE_ANNOUNCE1
                  tcp-check send QUIT\r\n
                  tcp-check expect string +OK
                  server R0 argocd-redis-ha-announce-0:26379 check inter 3s
                  server R1 argocd-redis-ha-announce-1:26379 check inter 3s
                  server R2 argocd-redis-ha-announce-2:26379 check inter 3s
                # Check Sentinel and whether they are nominated master
                backend check_if_redis_is_master_2
                  mode tcp
                  option tcp-check
                  tcp-check connect
                  tcp-check send PING\r\n
                  tcp-check expect string +PONG
                  tcp-check send SENTINEL\ get-master-addr-by-name\ argocd\r\n
                  tcp-check expect string REPLACE_ANNOUNCE2
                  tcp-check send QUIT\r\n
                  tcp-check expect string +OK
                  server R0 argocd-redis-ha-announce-0:26379 check inter 3s
                  server R1 argocd-redis-ha-announce-1:26379 check inter 3s
                  server R2 argocd-redis-ha-announce-2:26379 check inter 3s
                
                # decide redis backend to use
                #master
                frontend ft_redis_master
                  bind *:6379
                  use_backend bk_redis_master
                # Check all redis servers to see if they think they are master
                backend bk_redis_master
                  mode tcp
                  option tcp-check
                  tcp-check connect
                  tcp-check send PING\r\n
                  tcp-check expect string +PONG
                  tcp-check send info\ replication\r\n
                  tcp-check expect string role:master
                  tcp-check send QUIT\r\n
                  tcp-check expect string +OK
                  use-server R0 if { srv_is_up(R0) } { nbsrv(check_if_redis_is_master_0) ge 2 }
                  server R0 argocd-redis-ha-announce-0:6379 check inter 3s fall 1 rise 1
                  use-server R1 if { srv_is_up(R1) } { nbsrv(check_if_redis_is_master_1) ge 2 }
                  server R1 argocd-redis-ha-announce-1:6379 check inter 3s fall 1 rise 1
                  use-server R2 if { srv_is_up(R2) } { nbsrv(check_if_redis_is_master_2) ge 2 }
                  server R2 argocd-redis-ha-announce-2:6379 check inter 3s fall 1 rise 1
            EOT
+           "haproxy_init.sh" = <<-EOT
                HAPROXY_CONF=/data/haproxy.cfg
                cp /readonly/haproxy.cfg "$HAPROXY_CONF"
                for loop in $(seq 1 10); do
                  getent hosts argocd-redis-ha-announce-0 && break
                  echo "Waiting for service argocd-redis-ha-announce-0 to be ready ($loop) ..." && sleep 1
                done
                
                ANNOUNCE_IP0=$(getent hosts "argocd-redis-ha-announce-0" | awk '{ print $1 }')
                if [ -z "$ANNOUNCE_IP0" ]; then
                  echo "Could not resolve the announce ip for argocd-redis-ha-announce-0"
                  exit 1
                fi
                sed -i "s/REPLACE_ANNOUNCE0/$ANNOUNCE_IP0/" "$HAPROXY_CONF"
                
                if [ "${AUTH:-}" ]; then
                    echo "Setting auth values"
                    ESCAPED_AUTH=$(echo "$AUTH" | sed -e 's/[\/&]/\\&/g');
                    sed -i "s/REPLACE_AUTH_SECRET/${ESCAPED_AUTH}/" "$HAPROXY_CONF"
                fi
                for loop in $(seq 1 10); do
                  getent hosts argocd-redis-ha-announce-1 && break
                  echo "Waiting for service argocd-redis-ha-announce-1 to be ready ($loop) ..." && sleep 1
                done
                
                ANNOUNCE_IP1=$(getent hosts "argocd-redis-ha-announce-1" | awk '{ print $1 }')
                if [ -z "$ANNOUNCE_IP1" ]; then
                  echo "Could not resolve the announce ip for argocd-redis-ha-announce-1"
                  exit 1
                fi
                sed -i "s/REPLACE_ANNOUNCE1/$ANNOUNCE_IP1/" "$HAPROXY_CONF"
                
                if [ "${AUTH:-}" ]; then
                    echo "Setting auth values"
                    ESCAPED_AUTH=$(echo "$AUTH" | sed -e 's/[\/&]/\\&/g');
                    sed -i "s/REPLACE_AUTH_SECRET/${ESCAPED_AUTH}/" "$HAPROXY_CONF"
                fi
                for loop in $(seq 1 10); do
                  getent hosts argocd-redis-ha-announce-2 && break
                  echo "Waiting for service argocd-redis-ha-announce-2 to be ready ($loop) ..." && sleep 1
                done
                
                ANNOUNCE_IP2=$(getent hosts "argocd-redis-ha-announce-2" | awk '{ print $1 }')
                if [ -z "$ANNOUNCE_IP2" ]; then
                  echo "Could not resolve the announce ip for argocd-redis-ha-announce-2"
                  exit 1
                fi
                sed -i "s/REPLACE_ANNOUNCE2/$ANNOUNCE_IP2/" "$HAPROXY_CONF"
                
                if [ "${AUTH:-}" ]; then
                    echo "Setting auth values"
                    ESCAPED_AUTH=$(echo "$AUTH" | sed -e 's/[\/&]/\\&/g');
                    sed -i "s/REPLACE_AUTH_SECRET/${ESCAPED_AUTH}/" "$HAPROXY_CONF"
                fi
            EOT
+           "init.sh"         = <<-EOT
                HOSTNAME="$(hostname)"
                INDEX="${HOSTNAME##*-}"
                MASTER="$(redis-cli -h argocd-redis-ha -p 26379 sentinel get-master-addr-by-name argocd | grep -E '[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}')"
                MASTER_GROUP="argocd"
                QUORUM="2"
                REDIS_CONF=/data/conf/redis.conf
                REDIS_PORT=6379
                SENTINEL_CONF=/data/conf/sentinel.conf
                SENTINEL_PORT=26379
                SERVICE=argocd-redis-ha
                set -eu
                set -x
                
                sentinel_update() {
                    echo "Updating sentinel config with master $MASTER"
                    eval MY_SENTINEL_ID="\${SENTINEL_ID_$INDEX}"
                    sed -i "1s/^/sentinel myid $MY_SENTINEL_ID\\n/" "$SENTINEL_CONF"
                    sed -i "2s/^/sentinel monitor $MASTER_GROUP $1 $REDIS_PORT $QUORUM \\n/" "$SENTINEL_CONF"
                    echo " " >> $SENTINEL_CONF
                    echo "sentinel announce-ip $ANNOUNCE_IP" >> $SENTINEL_CONF
                    echo "sentinel announce-port $SENTINEL_PORT" >> $SENTINEL_CONF
                }
                
                redis_update() {
                    echo "Updating redis config"
                    echo " " >> $REDIS_CONF
                    echo "slaveof $1 $REDIS_PORT" >> "$REDIS_CONF"
                    echo "slave-announce-ip $ANNOUNCE_IP" >> $REDIS_CONF
                    echo "slave-announce-port $REDIS_PORT" >> $REDIS_CONF
                }
                
                copy_config() {
                    cp /readonly-config/redis.conf "$REDIS_CONF"
                    cp /readonly-config/sentinel.conf "$SENTINEL_CONF"
                }
                
                setup_defaults() {
                    echo "Setting up defaults"
                    if [ "$INDEX" = "0" ]; then
                        echo "Setting this pod as the default master"
                        redis_update "$ANNOUNCE_IP"
                        sentinel_update "$ANNOUNCE_IP"
                        sed -i "s/^.*slaveof.*//" "$REDIS_CONF"
                    else
                        DEFAULT_MASTER="$(getent hosts "$SERVICE-announce-0" | awk '{ print $1 }')"
                        if [ -z "$DEFAULT_MASTER" ]; then
                            echo "Unable to resolve host"
                            exit 1
                        fi
                        echo "Setting default slave config.."
                        redis_update "$DEFAULT_MASTER"
                        sentinel_update "$DEFAULT_MASTER"
                    fi
                }
                
                find_master() {
                    echo "Attempting to find master"
                    if [ "$(redis-cli -h "$MASTER" ping)" != "PONG" ]; then
                       echo "Can't ping master, attempting to force failover"
                       if redis-cli -h "$SERVICE" -p "$SENTINEL_PORT" sentinel failover "$MASTER_GROUP" | grep -q 'NOGOODSLAVE' ; then
                           setup_defaults
                           return 0
                       fi
                       sleep 10
                       MASTER="$(redis-cli -h $SERVICE -p $SENTINEL_PORT sentinel get-master-addr-by-name $MASTER_GROUP | grep -E '[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}')"
                       if [ "$MASTER" ]; then
                           sentinel_update "$MASTER"
                           redis_update "$MASTER"
                       else
                          echo "Could not failover, exiting..."
                          exit 1
                       fi
                    else
                        echo "Found reachable master, updating config"
                        sentinel_update "$MASTER"
                        redis_update "$MASTER"
                    fi
                }
                
                mkdir -p /data/conf/
                
                echo "Initializing config.."
                copy_config
                
                ANNOUNCE_IP=$(getent hosts "$SERVICE-announce-$INDEX" | awk '{ print $1 }')
                if [ -z "$ANNOUNCE_IP" ]; then
                    "Could not resolve the announce ip for this pod"
                    exit 1
                elif [ "$MASTER" ]; then
                    find_master
                else
                    setup_defaults
                fi
                
                if [ "${AUTH:-}" ]; then
                    echo "Setting auth values"
                    ESCAPED_AUTH=$(echo "$AUTH" | sed -e 's/[\/&]/\\&/g');
                    sed -i "s/replace-default-auth/${ESCAPED_AUTH}/" "$REDIS_CONF" "$SENTINEL_CONF"
                fi
                
                    echo "Ready..."
                
                    echo "Sentinel Config"
                    cat $SENTINEL_CONF
            EOT
+           "redis.conf"      = <<-EOT
                dir "/data"
                port 6379
                maxmemory 0
                maxmemory-policy volatile-lru
                min-replicas-max-lag 5
                min-replicas-to-write 1
                rdbchecksum yes
                rdbcompression yes
                repl-diskless-sync yes
                save ""
            EOT
+           "sentinel.conf"   = <<-EOT
                dir "/data"
                    sentinel down-after-milliseconds argocd 10000
                    sentinel failover-timeout argocd 180000
                    maxclients 10000
                    sentinel parallel-syncs argocd 5
            EOT
        }
+       id   = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/component" = "redis"
+               "app.kubernetes.io/name"      = "argocd-redis-ha"
+               "app.kubernetes.io/part-of"   = "argocd"
            }
+           name             = "argocd-redis-ha-configmap"
+           namespace        = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.argocd.kubernetes_config_map.argocd_ssh_known_hosts_cm will be created
+   resource "kubernetes_config_map" "argocd_ssh_known_hosts_cm" {
+       data = {
+           "ssh_known_hosts" = <<-EOT
                bitbucket.org ssh-rsa AAAAB3NzaC1yc2EAAAABIwAAAQEAubiN81eDcafrgMeLzaFPsw2kNvEcqTKl/VqLat/MaB33pZy0y3rJZtnqwR2qOOvbwKZYKiEO1O6VqNEBxKvJJelCq0dTXWT5pbO2gDXC6h6QDXCaHo6pOHGPUy+YBaGQRGuSusMEASYiWunYN0vCAI8QaXnWMXNMdFP3jHAJH0eDsoiGnLPBlBp4TNm6rYI74nMzgz3B9IikW4WVK+dc8KZJZWYjAuORU3jc1c/NPskD2ASinf8v3xnfXeukU0sJ5N6m5E8VLjObPEO+mN2t/FZTMZLiFqPWc/ALSqnMnnhwrNi2rbfg/rd/IpL8Le3pSBne8+seeFVBoGqzHM9yXw==
                github.com ssh-rsa AAAAB3NzaC1yc2EAAAABIwAAAQEAq2A7hRGmdnm9tUDbO9IDSwBK6TbQa+PXYPCPy6rbTrTtw7PHkccKrpp0yVhp5HdEIcKr6pLlVDBfOLX9QUsyCOV0wzfjIJNlGEYsdlLJizHhbn2mUjvSAHQqZETYP81eFzLQNnPHt4EVVUh7VfDESU84KezmD5QlWpXLmvU31/yMf+Se8xhHTvKSCZIFImWwoG6mbUoWf9nzpIoaSjB+weqqUUmpaaasXVal72J+UX2B+2RPW3RcT0eOzQgqlJL3RKrTJvdsjE3JEAvGq3lGHSZXy28G3skua2SmVi/w4yCE6gbODqnTWlg7+wC604ydGXA8VJiS5ap43JXiUFFAaQ==
                gitlab.com ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBFSMqzJeV9rUzU4kWitGjeR4PWSa29SPqJ1fVkhtj3Hw9xjLVXVYrU9QlYWrOLXBpQ6KWjbjTDTdDkoohFzgbEY=
                gitlab.com ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIAfuCHKVTjquxvt6CM6tdG4SLp1Btn/nOeHHE5UOzRdf
                gitlab.com ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCsj2bNKTBSpIYDEGk9KxsGh3mySTRgMtXL583qmBpzeQ+jqCMRgBqB98u3z++J1sKlXHWfM9dyhSevkMwSbhoR8XIq/U0tCNyokEi/ueaBMCvbcTHhO7FcwzY92WK4Yt0aGROY5qX2UKSeOvuP4D6TPqKF1onrSzH9bx9XUf2lEdWT/ia1NEKjunUqu1xOB/StKDHMoX4/OKyIzuS0q/T1zOATthvasJFoPrAjkohTyaDUz2LN5JoH839hViyEG82yB+MjcFV5MU3N1l1QL3cVUCh93xSaua1N85qivl+siMkPGbO5xR/En4iEY6K2XPASUEMaieWVNTRCtJ4S8H+9
                ssh.dev.azure.com ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC7Hr1oTWqNqOlzGJOfGJ4NakVyIzf1rXYd4d7wo6jBlkLvCA4odBlL0mDUyZ0/QUfTTqeu+tm22gOsv+VrVTMk6vwRU75gY/y9ut5Mb3bR5BV58dKXyq9A9UeB5Cakehn5Zgm6x1mKoVyf+FFn26iYqXJRgzIZZcZ5V6hrE0Qg39kZm4az48o0AUbf6Sp4SLdvnuMa2sVNwHBboS7EJkm57XQPVU3/QpyNLHbWDdzwtrlS+ez30S3AdYhLKEOxAG8weOnyrtLJAUen9mTkol8oII1edf7mWWbWVf0nBmly21+nZcmCTISQBtdcyPaEno7fFQMDD26/s0lfKob4Kw8H
                vs-ssh.visualstudio.com ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC7Hr1oTWqNqOlzGJOfGJ4NakVyIzf1rXYd4d7wo6jBlkLvCA4odBlL0mDUyZ0/QUfTTqeu+tm22gOsv+VrVTMk6vwRU75gY/y9ut5Mb3bR5BV58dKXyq9A9UeB5Cakehn5Zgm6x1mKoVyf+FFn26iYqXJRgzIZZcZ5V6hrE0Qg39kZm4az48o0AUbf6Sp4SLdvnuMa2sVNwHBboS7EJkm57XQPVU3/QpyNLHbWDdzwtrlS+ez30S3AdYhLKEOxAG8weOnyrtLJAUen9mTkol8oII1edf7mWWbWVf0nBmly21+nZcmCTISQBtdcyPaEno7fFQMDD26/s0lfKob4Kw8H
            EOT
        }
+       id   = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/name"    = "argocd-ssh-known-hosts-cm"
+               "app.kubernetes.io/part-of" = "argocd"
            }
+           name             = "argocd-ssh-known-hosts-cm"
+           namespace        = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.argocd.kubernetes_config_map.argocd_tls_certs_cm will be created
+   resource "kubernetes_config_map" "argocd_tls_certs_cm" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/name"    = "argocd-tls-certs-cm"
+               "app.kubernetes.io/part-of" = "argocd"
            }
+           name             = "argocd-tls-certs-cm"
+           namespace        = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.argocd.kubernetes_namespace.argocd_namespace will be created
+   resource "kubernetes_namespace" "argocd_namespace" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.argocd.kubernetes_secret.argocd_secret will be created
+   resource "kubernetes_secret" "argocd_secret" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "Opaque"

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/name"    = "argocd-secret"
+               "app.kubernetes.io/part-of" = "argocd"
            }
+           name             = "argocd-secret"
+           namespace        = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.argocd.module.argocd_application_controller.kubernetes_cluster_role_binding.argocd_application_controller will be created
+   resource "kubernetes_cluster_role_binding" "argocd_application_controller" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/component" = "application-controller"
+               "app.kubernetes.io/name"      = "argocd-application-controller"
+               "app.kubernetes.io/part-of"   = "argocd"
            }
+           name             = "argocd-application-controller"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       role_ref {
+           api_group = "rbac.authorization.k8s.io"
+           kind      = "ClusterRole"
+           name      = "argocd-application-controller"
        }

+       subject {
+           api_group = (known after apply)
+           kind      = "ServiceAccount"
+           name      = "argocd-application-controller"
+           namespace = "kube-argocd"
        }
    }

  # module.argocd.module.argocd_application_controller.kubernetes_deployment.argocd_application_controller will be created
+   resource "kubernetes_deployment" "argocd_application_controller" {
+       id               = (known after apply)
+       wait_for_rollout = true

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/component" = "application-controller"
+               "app.kubernetes.io/name"      = "argocd-application-controller"
+               "app.kubernetes.io/part-of"   = "argocd"
            }
+           name             = "argocd-application-controller"
+           namespace        = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           min_ready_seconds         = 0
+           paused                    = false
+           progress_deadline_seconds = 600
+           replicas                  = (known after apply)
+           revision_history_limit    = 10

+           selector {
+               match_labels = {
+                   "app.kubernetes.io/name" = "argocd-application-controller"
                }
            }

+           strategy {
+               type = "Recreate"

+               rolling_update {
+                   max_surge       = (known after apply)
+                   max_unavailable = (known after apply)
                }
            }

+           template {
+               metadata {
+                   generation       = (known after apply)
+                   labels           = {
+                       "app.kubernetes.io/name"    = "argocd-application-controller"
+                       "app.kubernetes.io/part-of" = "argocd"
                    }
+                   name             = (known after apply)
+                   resource_version = (known after apply)
+                   uid              = (known after apply)
                }

+               spec {
+                   automount_service_account_token  = true
+                   dns_policy                       = "ClusterFirst"
+                   enable_service_links             = true
+                   host_ipc                         = false
+                   host_network                     = false
+                   host_pid                         = false
+                   hostname                         = (known after apply)
+                   node_name                        = (known after apply)
+                   restart_policy                   = "Always"
+                   service_account_name             = "argocd-application-controller"
+                   share_process_namespace          = false
+                   termination_grace_period_seconds = 30

+                   container {
+                       command                    = [
+                           "argocd-application-controller",
+                           "--status-processors",
+                           "20",
+                           "--operation-processors",
+                           "10",
+                           "--repo-server-timeout-seconds",
+                           "300",
+                           "--redis",
+                           "argocd-redis:6379",
                        ]
+                       image                      = "docker.io/argoproj/argocd:v2.1.7"
+                       image_pull_policy          = "Always"
+                       name                       = "argocd-application-controller"
+                       stdin                      = false
+                       stdin_once                 = false
+                       termination_message_path   = "/dev/termination-log"
+                       termination_message_policy = (known after apply)
+                       tty                        = false

+                       liveness_probe {
+                           failure_threshold     = 3
+                           initial_delay_seconds = 5
+                           period_seconds        = 10
+                           success_threshold     = 1
+                           timeout_seconds       = 1

+                           http_get {
+                               path   = "/healthz"
+                               port   = "8082"
+                               scheme = "HTTP"
                            }
                        }

+                       port {
+                           container_port = 8082
+                           protocol       = "TCP"
                        }

+                       readiness_probe {
+                           failure_threshold     = 3
+                           initial_delay_seconds = 5
+                           period_seconds        = 10
+                           success_threshold     = 1
+                           timeout_seconds       = 1

+                           http_get {
+                               path   = "/healthz"
+                               port   = "8082"
+                               scheme = "HTTP"
                            }
                        }

+                       resources {
+                           limits   = (known after apply)
+                           requests = (known after apply)
                        }
                    }

+                   image_pull_secrets {
+                       name = (known after apply)
                    }

+                   readiness_gate {
+                       condition_type = (known after apply)
                    }

+                   volume {
+                       name = (known after apply)

+                       aws_elastic_block_store {
+                           fs_type   = (known after apply)
+                           partition = (known after apply)
+                           read_only = (known after apply)
+                           volume_id = (known after apply)
                        }

+                       azure_disk {
+                           caching_mode  = (known after apply)
+                           data_disk_uri = (known after apply)
+                           disk_name     = (known after apply)
+                           fs_type       = (known after apply)
+                           kind          = (known after apply)
+                           read_only     = (known after apply)
                        }

+                       azure_file {
+                           read_only        = (known after apply)
+                           secret_name      = (known after apply)
+                           secret_namespace = (known after apply)
+                           share_name       = (known after apply)
                        }

+                       ceph_fs {
+                           monitors    = (known after apply)
+                           path        = (known after apply)
+                           read_only   = (known after apply)
+                           secret_file = (known after apply)
+                           user        = (known after apply)

+                           secret_ref {
+                               name      = (known after apply)
+                               namespace = (known after apply)
                            }
                        }

+                       cinder {
+                           fs_type   = (known after apply)
+                           read_only = (known after apply)
+                           volume_id = (known after apply)
                        }

+                       config_map {
+                           default_mode = (known after apply)
+                           name         = (known after apply)
+                           optional     = (known after apply)

+                           items {
+                               key  = (known after apply)
+                               mode = (known after apply)
+                               path = (known after apply)
                            }
                        }

+                       csi {
+                           driver            = (known after apply)
+                           fs_type           = (known after apply)
+                           read_only         = (known after apply)
+                           volume_attributes = (known after apply)
+                           volume_handle     = (known after apply)

+                           controller_expand_secret_ref {
+                               name      = (known after apply)
+                               namespace = (known after apply)
                            }

+                           controller_publish_secret_ref {
+                               name      = (known after apply)
+                               namespace = (known after apply)
                            }

+                           node_publish_secret_ref {
+                               name      = (known after apply)
+                               namespace = (known after apply)
                            }

+                           node_stage_secret_ref {
+                               name      = (known after apply)
+                               namespace = (known after apply)
                            }
                        }

+                       downward_api {
+                           default_mode = (known after apply)

+                           items {
+                               mode = (known after apply)
+                               path = (known after apply)

+                               field_ref {
+                                   api_version = (known after apply)
+                                   field_path  = (known after apply)
                                }

+                               resource_field_ref {
+                                   container_name = (known after apply)
+                                   divisor        = (known after apply)
+                                   resource       = (known after apply)
                                }
                            }
                        }

+                       empty_dir {
+                           medium     = (known after apply)
+                           size_limit = (known after apply)
                        }

+                       fc {
+                           fs_type      = (known after apply)
+                           lun          = (known after apply)
+                           read_only    = (known after apply)
+                           target_ww_ns = (known after apply)
                        }

+                       flex_volume {
+                           driver    = (known after apply)
+                           fs_type   = (known after apply)
+                           options   = (known after apply)
+                           read_only = (known after apply)

+                           secret_ref {
+                               name      = (known after apply)
+                               namespace = (known after apply)
                            }
                        }

+                       flocker {
+                           dataset_name = (known after apply)
+                           dataset_uuid = (known after apply)
                        }

+                       gce_persistent_disk {
+                           fs_type   = (known after apply)
+                           partition = (known after apply)
+                           pd_name   = (known after apply)
+                           read_only = (known after apply)
                        }

+                       git_repo {
+                           directory  = (known after apply)
+                           repository = (known after apply)
+                           revision   = (known after apply)
                        }

+                       glusterfs {
+                           endpoints_name = (known after apply)
+                           path           = (known after apply)
+                           read_only      = (known after apply)
                        }

+                       host_path {
+                           path = (known after apply)
+                           type = (known after apply)
                        }

+                       iscsi {
+                           fs_type         = (known after apply)
+                           iqn             = (known after apply)
+                           iscsi_interface = (known after apply)
+                           lun             = (known after apply)
+                           read_only       = (known after apply)
+                           target_portal   = (known after apply)
                        }

+                       local {
+                           path = (known after apply)
                        }

+                       nfs {
+                           path      = (known after apply)
+                           read_only = (known after apply)
+                           server    = (known after apply)
                        }

+                       persistent_volume_claim {
+                           claim_name = (known after apply)
+                           read_only  = (known after apply)
                        }

+                       photon_persistent_disk {
+                           fs_type = (known after apply)
+                           pd_id   = (known after apply)
                        }

+                       projected {
+                           default_mode = (known after apply)

+                           sources {
+                               config_map {
+                                   name     = (known after apply)
+                                   optional = (known after apply)

+                                   items {
+                                       key  = (known after apply)
+                                       mode = (known after apply)
+                                       path = (known after apply)
                                    }
                                }

+                               downward_api {
+                                   items {
+                                       mode = (known after apply)
+                                       path = (known after apply)

+                                       field_ref {
+                                           api_version = (known after apply)
+                                           field_path  = (known after apply)
                                        }

+                                       resource_field_ref {
+                                           container_name = (known after apply)
+                                           divisor        = (known after apply)
+                                           resource       = (known after apply)
                                        }
                                    }
                                }

+                               secret {
+                                   name     = (known after apply)
+                                   optional = (known after apply)

+                                   items {
+                                       key  = (known after apply)
+                                       mode = (known after apply)
+                                       path = (known after apply)
                                    }
                                }

+                               service_account_token {
+                                   audience           = (known after apply)
+                                   expiration_seconds = (known after apply)
+                                   path               = (known after apply)
                                }
                            }
                        }

+                       quobyte {
+                           group     = (known after apply)
+                           read_only = (known after apply)
+                           registry  = (known after apply)
+                           user      = (known after apply)
+                           volume    = (known after apply)
                        }

+                       rbd {
+                           ceph_monitors = (known after apply)
+                           fs_type       = (known after apply)
+                           keyring       = (known after apply)
+                           rados_user    = (known after apply)
+                           rbd_image     = (known after apply)
+                           rbd_pool      = (known after apply)
+                           read_only     = (known after apply)

+                           secret_ref {
+                               name      = (known after apply)
+                               namespace = (known after apply)
                            }
                        }

+                       secret {
+                           default_mode = (known after apply)
+                           optional     = (known after apply)
+                           secret_name  = (known after apply)

+                           items {
+                               key  = (known after apply)
+                               mode = (known after apply)
+                               path = (known after apply)
                            }
                        }

+                       vsphere_volume {
+                           fs_type     = (known after apply)
+                           volume_path = (known after apply)
                        }
                    }
                }
            }
        }
    }

  # module.argocd.module.argocd_application_controller.kubernetes_role.argocd_application_controller will be created
+   resource "kubernetes_role" "argocd_application_controller" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/component" = "application-controller"
+               "app.kubernetes.io/name"      = "argocd-application-controller"
+               "app.kubernetes.io/part-of"   = "argocd"
            }
+           name             = "argocd-application-controller"
+           namespace        = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       rule {
+           api_groups = [
+               "",
            ]
+           resources  = [
+               "configmaps",
+               "secrets",
            ]
+           verbs      = [
+               "get",
+               "list",
+               "watch",
            ]
        }
+       rule {
+           api_groups = [
+               "",
            ]
+           resources  = [
+               "events",
            ]
+           verbs      = [
+               "create",
+               "list",
            ]
        }
+       rule {
+           api_groups = [
+               "argoproj.io",
            ]
+           resources  = [
+               "applications",
+               "appprojects",
            ]
+           verbs      = [
+               "create",
+               "delete",
+               "get",
+               "list",
+               "patch",
+               "update",
+               "watch",
            ]
        }
    }

  # module.argocd.module.argocd_application_controller.kubernetes_role_binding.argocd_application_controller will be created
+   resource "kubernetes_role_binding" "argocd_application_controller" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/component" = "application-controller"
+               "app.kubernetes.io/name"      = "argocd-application-controller"
+               "app.kubernetes.io/part-of"   = "argocd"
            }
+           name             = "argocd-application-controller"
+           namespace        = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       role_ref {
+           api_group = "rbac.authorization.k8s.io"
+           kind      = "Role"
+           name      = "argocd-application-controller"
        }

+       subject {
+           api_group = (known after apply)
+           kind      = "ServiceAccount"
+           name      = "argocd-application-controller"
+           namespace = "kube-argocd"
        }
    }

  # module.argocd.module.argocd_application_controller.kubernetes_service.argocd_metrics will be created
+   resource "kubernetes_service" "argocd_metrics" {
+       id                     = (known after apply)
+       status                 = (known after apply)
+       wait_for_load_balancer = true

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/component" = "metrics"
+               "app.kubernetes.io/name"      = "argocd-metrics"
+               "app.kubernetes.io/part-of"   = "argocd"
            }
+           name             = "argocd-metrics"
+           namespace        = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           cluster_ip                  = (known after apply)
+           external_traffic_policy     = (known after apply)
+           health_check_node_port      = (known after apply)
+           publish_not_ready_addresses = false
+           selector                    = {
+               "app.kubernetes.io/name" = "argocd-application-controller"
            }
+           session_affinity            = "None"
+           type                        = "ClusterIP"

+           port {
+               name        = "metrics"
+               node_port   = (known after apply)
+               port        = 8082
+               protocol    = "TCP"
+               target_port = "8082"
            }
        }
    }

  # module.argocd.module.argocd_application_controller.kubernetes_service_account.argocd_application_controller will be created
+   resource "kubernetes_service_account" "argocd_application_controller" {
+       automount_service_account_token = true
+       default_secret_name             = (known after apply)
+       id                              = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/component" = "application-controller"
+               "app.kubernetes.io/name"      = "argocd-application-controller"
+               "app.kubernetes.io/part-of"   = "argocd"
            }
+           name             = "argocd-application-controller"
+           namespace        = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.argocd.module.argocd_repo_server.kubernetes_deployment.argocd_repo_server will be created
+   resource "kubernetes_deployment" "argocd_repo_server" {
+       id               = (known after apply)
+       wait_for_rollout = true

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/component" = "repo-server"
+               "app.kubernetes.io/name"      = "argocd-repo-server"
+               "app.kubernetes.io/part-of"   = "argocd"
            }
+           name             = "argocd-repo-server"
+           namespace        = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           min_ready_seconds         = 0
+           paused                    = false
+           progress_deadline_seconds = 600
+           replicas                  = "2"
+           revision_history_limit    = 10

+           selector {
+               match_labels = {
+                   "app.kubernetes.io/name" = "argocd-repo-server"
                }
            }

+           strategy {
+               type = (known after apply)

+               rolling_update {
+                   max_surge       = (known after apply)
+                   max_unavailable = (known after apply)
                }
            }

+           template {
+               metadata {
+                   generation       = (known after apply)
+                   labels           = {
+                       "app.kubernetes.io/component" = "repo-server"
+                       "app.kubernetes.io/name"      = "argocd-repo-server"
+                       "app.kubernetes.io/part-of"   = "argocd"
                    }
+                   name             = (known after apply)
+                   resource_version = (known after apply)
+                   uid              = (known after apply)
                }

+               spec {
+                   automount_service_account_token  = false
+                   dns_policy                       = "ClusterFirst"
+                   enable_service_links             = true
+                   host_ipc                         = false
+                   host_network                     = false
+                   host_pid                         = false
+                   hostname                         = (known after apply)
+                   node_name                        = (known after apply)
+                   restart_policy                   = "Always"
+                   service_account_name             = (known after apply)
+                   share_process_namespace          = false
+                   termination_grace_period_seconds = 30

+                   affinity {

+                       pod_anti_affinity {
+                           preferred_during_scheduling_ignored_during_execution {
+                               weight = 100

+                               pod_affinity_term {
+                                   topology_key = "failure-domain.beta.kubernetes.io/zone"

+                                   label_selector {
+                                       match_labels = {
+                                           "app.kubernetes.io/name" = "argocd-repo-server"
                                        }
                                    }
                                }
                            }

+                           required_during_scheduling_ignored_during_execution {
+                               topology_key = "kubernetes.io/hostname"

+                               label_selector {
+                                   match_labels = {
+                                       "app.kubernetes.io/name" = "argocd-repo-server"
                                    }
                                }
                            }
                        }
                    }

+                   container {
+                       command                    = [
+                           "uid_entrypoint.sh",
+                           "argocd-repo-server",
+                           "--redis",
+                           "argocd-redis:6379",
                        ]
+                       image                      = "docker.io/argoproj/argocd:v2.1.7"
+                       image_pull_policy          = "Always"
+                       name                       = "argocd-repo-server"
+                       stdin                      = false
+                       stdin_once                 = false
+                       termination_message_path   = "/dev/termination-log"
+                       termination_message_policy = (known after apply)
+                       tty                        = false

+                       env {
+                           name  = "ARGOCD_EXEC_TIMEOUT"
+                           value = "300"
                        }

+                       liveness_probe {
+                           failure_threshold     = 3
+                           initial_delay_seconds = 5
+                           period_seconds        = 5
+                           success_threshold     = 1
+                           timeout_seconds       = 1

+                           tcp_socket {
+                               port = "8081"
                            }
                        }

+                       port {
+                           container_port = 8081
+                           protocol       = "TCP"
                        }
+                       port {
+                           container_port = 8084
+                           protocol       = "TCP"
                        }

+                       readiness_probe {
+                           failure_threshold     = 3
+                           initial_delay_seconds = 5
+                           period_seconds        = 10
+                           success_threshold     = 1
+                           timeout_seconds       = 1

+                           tcp_socket {
+                               port = "8081"
                            }
                        }

+                       resources {
+                           limits   = {
+                               "cpu"    = "600m"
+                               "memory" = "512Mi"
                            }
+                           requests = {
+                               "cpu"    = "300m"
+                               "memory" = "256Mi"
                            }
                        }

+                       volume_mount {
+                           mount_path        = "/app/config/ssh"
+                           mount_propagation = "None"
+                           name              = "ssh-known-hosts"
+                           read_only         = false
                        }
+                       volume_mount {
+                           mount_path        = "/app/config/tls"
+                           mount_propagation = "None"
+                           name              = "tls-certs"
+                           read_only         = false
                        }
+                       volume_mount {
+                           mount_path        = "/app/config/gpg/source"
+                           mount_propagation = "None"
+                           name              = "gpg-keys"
+                           read_only         = false
                        }
+                       volume_mount {
+                           mount_path        = "/app/config/gpg/keys"
+                           mount_propagation = "None"
+                           name              = "gpg-keyring"
+                           read_only         = false
                        }
                    }

+                   image_pull_secrets {
+                       name = (known after apply)
                    }

+                   readiness_gate {
+                       condition_type = (known after apply)
                    }

+                   volume {
+                       name = "ssh-known-hosts"

+                       config_map {
+                           default_mode = "0644"
+                           name         = "argocd-ssh-known-hosts-cm"
                        }
                    }
+                   volume {
+                       name = "tls-certs"

+                       config_map {
+                           default_mode = "0644"
+                           name         = "argocd-tls-certs-cm"
                        }
                    }
+                   volume {
+                       name = "gpg-keys"

+                       config_map {
+                           default_mode = "0644"
+                           name         = "argocd-gpg-keys-cm"
                        }
                    }
+                   volume {
+                       name = "gpg-keyring"

+                       empty_dir {}
                    }
                }
            }
        }
    }

  # module.argocd.module.argocd_repo_server.kubernetes_service.argocd_repo_server will be created
+   resource "kubernetes_service" "argocd_repo_server" {
+       id                     = (known after apply)
+       status                 = (known after apply)
+       wait_for_load_balancer = true

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/component" = "repo-server"
+               "app.kubernetes.io/name"      = "argocd-repo-server"
+               "app.kubernetes.io/part-of"   = "argocd"
            }
+           name             = "argocd-repo-server"
+           namespace        = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           cluster_ip                  = (known after apply)
+           external_traffic_policy     = (known after apply)
+           health_check_node_port      = (known after apply)
+           publish_not_ready_addresses = false
+           selector                    = {
+               "app.kubernetes.io/name" = "argocd-repo-server"
            }
+           session_affinity            = "None"
+           type                        = "ClusterIP"

+           port {
+               name        = "server"
+               node_port   = (known after apply)
+               port        = 8081
+               protocol    = "TCP"
+               target_port = "8081"
            }
+           port {
+               name        = "metrics"
+               node_port   = (known after apply)
+               port        = 8084
+               protocol    = "TCP"
+               target_port = "8084"
            }
        }
    }

  # module.argocd.module.argocd_server.kubernetes_cluster_role_binding.server_cluster_role_binding will be created
+   resource "kubernetes_cluster_role_binding" "server_cluster_role_binding" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/component" = "server"
+               "app.kubernetes.io/name"      = "argocd-server"
+               "app.kubernetes.io/part-of"   = "argocd"
            }
+           name             = "argocd-server"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       role_ref {
+           api_group = "rbac.authorization.k8s.io"
+           kind      = "ClusterRole"
+           name      = "argocd-server"
        }

+       subject {
+           api_group = (known after apply)
+           kind      = "ServiceAccount"
+           name      = "argocd-server"
+           namespace = "kube-argocd"
        }
    }

  # module.argocd.module.argocd_server.kubernetes_deployment.server_deployment will be created
+   resource "kubernetes_deployment" "server_deployment" {
+       id               = (known after apply)
+       wait_for_rollout = true

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/component" = "server"
+               "app.kubernetes.io/name"      = "argocd-server"
+               "app.kubernetes.io/part-of"   = "argocd"
            }
+           name             = "argocd-server"
+           namespace        = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           min_ready_seconds         = 0
+           paused                    = false
+           progress_deadline_seconds = 600
+           replicas                  = "2"
+           revision_history_limit    = 10

+           selector {
+               match_labels = {
+                   "app.kubernetes.io/name" = "argocd-server"
                }
            }

+           strategy {
+               type = (known after apply)

+               rolling_update {
+                   max_surge       = (known after apply)
+                   max_unavailable = (known after apply)
                }
            }

+           template {
+               metadata {
+                   generation       = (known after apply)
+                   labels           = {
+                       "app.kubernetes.io/name"    = "argocd-server"
+                       "app.kubernetes.io/part-of" = "argocd"
                    }
+                   name             = (known after apply)
+                   resource_version = (known after apply)
+                   uid              = (known after apply)
                }

+               spec {
+                   automount_service_account_token  = false
+                   dns_policy                       = "ClusterFirst"
+                   enable_service_links             = true
+                   host_ipc                         = false
+                   host_network                     = false
+                   host_pid                         = false
+                   hostname                         = (known after apply)
+                   node_name                        = (known after apply)
+                   restart_policy                   = "Always"
+                   service_account_name             = "argocd-server"
+                   share_process_namespace          = false
+                   termination_grace_period_seconds = 30

+                   affinity {

+                       pod_anti_affinity {
+                           preferred_during_scheduling_ignored_during_execution {
+                               weight = 100

+                               pod_affinity_term {
+                                   topology_key = "failure-domain.beta.kubernetes.io/zone"

+                                   label_selector {
+                                       match_labels = {
+                                           "app.kubernetes.io/name" = "argocd-server"
                                        }
                                    }
                                }
                            }

+                           required_during_scheduling_ignored_during_execution {
+                               topology_key = "kubernetes.io/hostname"

+                               label_selector {
+                                   match_labels = {
+                                       "app.kubernetes.io/name" = "argocd-server"
                                    }
                                }
                            }
                        }
                    }

+                   container {
+                       command                    = [
+                           "argocd-server",
+                           "--staticassets",
+                           "/shared/app",
+                           "--redis",
+                           "argocd-redis:6379",
                        ]
+                       image                      = "docker.io/argoproj/argocd:v2.1.7"
+                       image_pull_policy          = "Always"
+                       name                       = "argocd-server"
+                       stdin                      = false
+                       stdin_once                 = false
+                       termination_message_path   = "/dev/termination-log"
+                       termination_message_policy = (known after apply)
+                       tty                        = false

+                       env {
+                           name  = "ARGOCD_API_SERVER_REPLICAS"
+                           value = "2"
                        }
+                       env {
+                           name  = "ARGOCD_MAX_CONCURRENT_LOGIN_REQUESTS_COUNT"
+                           value = "0"
                        }

+                       liveness_probe {
+                           failure_threshold     = 3
+                           initial_delay_seconds = 30
+                           period_seconds        = 5
+                           success_threshold     = 1
+                           timeout_seconds       = 1

+                           http_get {
+                               path   = "/healthz"
+                               port   = "8080"
+                               scheme = "HTTP"
                            }
                        }

+                       port {
+                           container_port = 8080
+                           protocol       = "TCP"
                        }
+                       port {
+                           container_port = 8083
+                           protocol       = "TCP"
                        }

+                       readiness_probe {
+                           failure_threshold     = 3
+                           initial_delay_seconds = 30
+                           period_seconds        = 30
+                           success_threshold     = 1
+                           timeout_seconds       = 1

+                           http_get {
+                               path   = "/healthz"
+                               port   = "8080"
+                               scheme = "HTTP"
                            }
                        }

+                       resources {
+                           limits   = {
+                               "cpu"    = "600m"
+                               "memory" = "512Mi"
                            }
+                           requests = {
+                               "cpu"    = "300m"
+                               "memory" = "256Mi"
                            }
                        }

+                       volume_mount {
+                           mount_path        = "/var/run/secrets/kubernetes.io/serviceaccount/"
+                           mount_propagation = "None"
+                           name              = "service-token"
+                           read_only         = true
                        }
+                       volume_mount {
+                           mount_path        = "/app/config/ssh"
+                           mount_propagation = "None"
+                           name              = "ssh-known-hosts"
+                           read_only         = false
                        }
+                       volume_mount {
+                           mount_path        = "/app/config/tls"
+                           mount_propagation = "None"
+                           name              = "tls-certs"
+                           read_only         = false
                        }
                    }

+                   image_pull_secrets {
+                       name = (known after apply)
                    }

+                   readiness_gate {
+                       condition_type = (known after apply)
                    }

+                   volume {
+                       name = "service-token"

+                       secret {
+                           default_mode = "0644"
+                           secret_name  = (known after apply)
                        }
                    }
+                   volume {
+                       name = "static-files"

+                       empty_dir {}
                    }
+                   volume {
+                       name = "ssh-known-hosts"

+                       config_map {
+                           default_mode = "0644"
+                           name         = "argocd-ssh-known-hosts-cm"
                        }
                    }
+                   volume {
+                       name = "tls-certs"

+                       config_map {
+                           default_mode = "0644"
+                           name         = "argocd-tls-certs-cm"
                        }
                    }
                }
            }
        }
    }

  # module.argocd.module.argocd_server.kubernetes_ingress.argocd_ingress_route[0] will be created
+   resource "kubernetes_ingress" "argocd_ingress_route" {
+       id     = (known after apply)
+       status = (known after apply)

+       metadata {
+           annotations      = {
+               "cert-manager.io/cluster-issuer" = "ZeroSSL"
            }
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/component" = "server"
+               "app.kubernetes.io/part-of"   = "argocd"
            }
+           name             = "argocd-server"
+           namespace        = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           ingress_class_name = "istio"

+           rule {
+               host = "argocd.wayofthesys.org"

+               http {
+                   path {
+                       path = "/"

+                       backend {
+                           service_name = "argocd-server"
+                           service_port = "443"
                        }
                    }
                }
            }

+           tls {
+               hosts       = [
+                   "argocd.wayofthesys.org",
                ]
+               secret_name = "argocd-ingress-tls"
            }
        }
    }

  # module.argocd.module.argocd_server.kubernetes_role.argocd_server will be created
+   resource "kubernetes_role" "argocd_server" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/component" = "server"
+               "app.kubernetes.io/name"      = "argocd-server"
+               "app.kubernetes.io/part-of"   = "argocd"
            }
+           name             = "argocd-server"
+           namespace        = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       rule {
+           api_groups = [
+               "",
            ]
+           resources  = [
+               "configmaps",
+               "secrets",
            ]
+           verbs      = [
+               "create",
+               "delete",
+               "get",
+               "list",
+               "patch",
+               "update",
+               "watch",
            ]
        }
+       rule {
+           api_groups = [
+               "",
            ]
+           resources  = [
+               "events",
            ]
+           verbs      = [
+               "create",
+               "list",
            ]
        }
+       rule {
+           api_groups = [
+               "argoproj.io",
            ]
+           resources  = [
+               "applications",
+               "appprojects",
            ]
+           verbs      = [
+               "create",
+               "delete",
+               "get",
+               "list",
+               "patch",
+               "update",
+               "watch",
            ]
        }
    }

  # module.argocd.module.argocd_server.kubernetes_role_binding.argocd_server will be created
+   resource "kubernetes_role_binding" "argocd_server" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/component" = "server"
+               "app.kubernetes.io/name"      = "argocd-server"
+               "app.kubernetes.io/part-of"   = "argocd"
            }
+           name             = "argocd-server"
+           namespace        = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       role_ref {
+           api_group = "rbac.authorization.k8s.io"
+           kind      = "Role"
+           name      = "argocd-server"
        }

+       subject {
+           api_group = (known after apply)
+           kind      = "ServiceAccount"
+           name      = "argocd-server"
+           namespace = "kube-argocd"
        }
    }

  # module.argocd.module.argocd_server.kubernetes_service.argocd_server will be created
+   resource "kubernetes_service" "argocd_server" {
+       id                     = (known after apply)
+       status                 = (known after apply)
+       wait_for_load_balancer = true

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/component" = "server"
+               "app.kubernetes.io/name"      = "argocd-server"
+               "app.kubernetes.io/part-of"   = "argocd"
            }
+           name             = "argocd-server"
+           namespace        = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           cluster_ip                  = (known after apply)
+           external_traffic_policy     = (known after apply)
+           health_check_node_port      = (known after apply)
+           publish_not_ready_addresses = false
+           selector                    = {
+               "app.kubernetes.io/name" = "argocd-server"
            }
+           session_affinity            = "None"
+           type                        = "ClusterIP"

+           port {
+               name        = "http"
+               node_port   = (known after apply)
+               port        = 80
+               protocol    = "TCP"
+               target_port = "8080"
            }
+           port {
+               name        = "https"
+               node_port   = (known after apply)
+               port        = 443
+               protocol    = "TCP"
+               target_port = "8080"
            }
        }
    }

  # module.argocd.module.argocd_server.kubernetes_service.argocd_server_metrics will be created
+   resource "kubernetes_service" "argocd_server_metrics" {
+       id                     = (known after apply)
+       status                 = (known after apply)
+       wait_for_load_balancer = true

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/component" = "server"
+               "app.kubernetes.io/name"      = "argocd-server-metrics"
+               "app.kubernetes.io/part-of"   = "argocd"
            }
+           name             = "argocd-server-metrics"
+           namespace        = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           cluster_ip                  = (known after apply)
+           external_traffic_policy     = (known after apply)
+           health_check_node_port      = (known after apply)
+           publish_not_ready_addresses = false
+           selector                    = {
+               "app.kubernetes.io/name" = "argocd-server-metrics"
            }
+           session_affinity            = "None"
+           type                        = "ClusterIP"

+           port {
+               name        = "metrics"
+               node_port   = (known after apply)
+               port        = 8083
+               protocol    = "TCP"
+               target_port = "8083"
            }
        }
    }

  # module.argocd.module.argocd_server.kubernetes_service_account.server_service_account will be created
+   resource "kubernetes_service_account" "server_service_account" {
+       automount_service_account_token = true
+       default_secret_name             = (known after apply)
+       id                              = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/component" = "server"
+               "app.kubernetes.io/name"      = "argocd-server"
+               "app.kubernetes.io/part-of"   = "argocd"
            }
+           name             = "argocd-server"
+           namespace        = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.argocd.module.argocd_redis.module.argocd_redis[0].kubernetes_deployment.argocd_redis will be created
+   resource "kubernetes_deployment" "argocd_redis" {
+       id               = (known after apply)
+       wait_for_rollout = true

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/component" = "redis"
+               "app.kubernetes.io/name"      = "argocd-redis"
+               "app.kubernetes.io/part-of"   = "argocd"
            }
+           name             = "argocd-redis"
+           namespace        = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           min_ready_seconds         = 0
+           paused                    = false
+           progress_deadline_seconds = 600
+           replicas                  = (known after apply)
+           revision_history_limit    = 10

+           selector {
+               match_labels = {
+                   "app.kubernetes.io/name" = "argocd-redis"
                }
            }

+           strategy {
+               type = (known after apply)

+               rolling_update {
+                   max_surge       = (known after apply)
+                   max_unavailable = (known after apply)
                }
            }

+           template {
+               metadata {
+                   generation       = (known after apply)
+                   labels           = {
+                       "app.kubernetes.io/name" = "argocd-redis"
                    }
+                   name             = (known after apply)
+                   resource_version = (known after apply)
+                   uid              = (known after apply)
                }

+               spec {
+                   automount_service_account_token  = true
+                   dns_policy                       = "ClusterFirst"
+                   enable_service_links             = true
+                   host_ipc                         = false
+                   host_network                     = false
+                   host_pid                         = false
+                   hostname                         = (known after apply)
+                   node_name                        = (known after apply)
+                   restart_policy                   = "Always"
+                   service_account_name             = (known after apply)
+                   share_process_namespace          = false
+                   termination_grace_period_seconds = 30

+                   container {
+                       args                       = [
+                           "--save",
+                           "",
+                           "--appendonly",
+                           "no",
                        ]
+                       image                      = "docker.io/redis:6.2.6-alpine"
+                       image_pull_policy          = "Always"
+                       name                       = "redis"
+                       stdin                      = false
+                       stdin_once                 = false
+                       termination_message_path   = "/dev/termination-log"
+                       termination_message_policy = (known after apply)
+                       tty                        = false

+                       port {
+                           container_port = 6379
+                           protocol       = "TCP"
                        }

+                       resources {
+                           limits   = (known after apply)
+                           requests = (known after apply)
                        }
                    }

+                   image_pull_secrets {
+                       name = (known after apply)
                    }

+                   readiness_gate {
+                       condition_type = (known after apply)
                    }

+                   security_context {
+                       fs_group        = "1000"
+                       run_as_group    = "1000"
+                       run_as_non_root = true
+                       run_as_user     = "1000"
                    }

+                   volume {
+                       name = (known after apply)

+                       aws_elastic_block_store {
+                           fs_type   = (known after apply)
+                           partition = (known after apply)
+                           read_only = (known after apply)
+                           volume_id = (known after apply)
                        }

+                       azure_disk {
+                           caching_mode  = (known after apply)
+                           data_disk_uri = (known after apply)
+                           disk_name     = (known after apply)
+                           fs_type       = (known after apply)
+                           kind          = (known after apply)
+                           read_only     = (known after apply)
                        }

+                       azure_file {
+                           read_only        = (known after apply)
+                           secret_name      = (known after apply)
+                           secret_namespace = (known after apply)
+                           share_name       = (known after apply)
                        }

+                       ceph_fs {
+                           monitors    = (known after apply)
+                           path        = (known after apply)
+                           read_only   = (known after apply)
+                           secret_file = (known after apply)
+                           user        = (known after apply)

+                           secret_ref {
+                               name      = (known after apply)
+                               namespace = (known after apply)
                            }
                        }

+                       cinder {
+                           fs_type   = (known after apply)
+                           read_only = (known after apply)
+                           volume_id = (known after apply)
                        }

+                       config_map {
+                           default_mode = (known after apply)
+                           name         = (known after apply)
+                           optional     = (known after apply)

+                           items {
+                               key  = (known after apply)
+                               mode = (known after apply)
+                               path = (known after apply)
                            }
                        }

+                       csi {
+                           driver            = (known after apply)
+                           fs_type           = (known after apply)
+                           read_only         = (known after apply)
+                           volume_attributes = (known after apply)
+                           volume_handle     = (known after apply)

+                           controller_expand_secret_ref {
+                               name      = (known after apply)
+                               namespace = (known after apply)
                            }

+                           controller_publish_secret_ref {
+                               name      = (known after apply)
+                               namespace = (known after apply)
                            }

+                           node_publish_secret_ref {
+                               name      = (known after apply)
+                               namespace = (known after apply)
                            }

+                           node_stage_secret_ref {
+                               name      = (known after apply)
+                               namespace = (known after apply)
                            }
                        }

+                       downward_api {
+                           default_mode = (known after apply)

+                           items {
+                               mode = (known after apply)
+                               path = (known after apply)

+                               field_ref {
+                                   api_version = (known after apply)
+                                   field_path  = (known after apply)
                                }

+                               resource_field_ref {
+                                   container_name = (known after apply)
+                                   divisor        = (known after apply)
+                                   resource       = (known after apply)
                                }
                            }
                        }

+                       empty_dir {
+                           medium     = (known after apply)
+                           size_limit = (known after apply)
                        }

+                       fc {
+                           fs_type      = (known after apply)
+                           lun          = (known after apply)
+                           read_only    = (known after apply)
+                           target_ww_ns = (known after apply)
                        }

+                       flex_volume {
+                           driver    = (known after apply)
+                           fs_type   = (known after apply)
+                           options   = (known after apply)
+                           read_only = (known after apply)

+                           secret_ref {
+                               name      = (known after apply)
+                               namespace = (known after apply)
                            }
                        }

+                       flocker {
+                           dataset_name = (known after apply)
+                           dataset_uuid = (known after apply)
                        }

+                       gce_persistent_disk {
+                           fs_type   = (known after apply)
+                           partition = (known after apply)
+                           pd_name   = (known after apply)
+                           read_only = (known after apply)
                        }

+                       git_repo {
+                           directory  = (known after apply)
+                           repository = (known after apply)
+                           revision   = (known after apply)
                        }

+                       glusterfs {
+                           endpoints_name = (known after apply)
+                           path           = (known after apply)
+                           read_only      = (known after apply)
                        }

+                       host_path {
+                           path = (known after apply)
+                           type = (known after apply)
                        }

+                       iscsi {
+                           fs_type         = (known after apply)
+                           iqn             = (known after apply)
+                           iscsi_interface = (known after apply)
+                           lun             = (known after apply)
+                           read_only       = (known after apply)
+                           target_portal   = (known after apply)
                        }

+                       local {
+                           path = (known after apply)
                        }

+                       nfs {
+                           path      = (known after apply)
+                           read_only = (known after apply)
+                           server    = (known after apply)
                        }

+                       persistent_volume_claim {
+                           claim_name = (known after apply)
+                           read_only  = (known after apply)
                        }

+                       photon_persistent_disk {
+                           fs_type = (known after apply)
+                           pd_id   = (known after apply)
                        }

+                       projected {
+                           default_mode = (known after apply)

+                           sources {
+                               config_map {
+                                   name     = (known after apply)
+                                   optional = (known after apply)

+                                   items {
+                                       key  = (known after apply)
+                                       mode = (known after apply)
+                                       path = (known after apply)
                                    }
                                }

+                               downward_api {
+                                   items {
+                                       mode = (known after apply)
+                                       path = (known after apply)

+                                       field_ref {
+                                           api_version = (known after apply)
+                                           field_path  = (known after apply)
                                        }

+                                       resource_field_ref {
+                                           container_name = (known after apply)
+                                           divisor        = (known after apply)
+                                           resource       = (known after apply)
                                        }
                                    }
                                }

+                               secret {
+                                   name     = (known after apply)
+                                   optional = (known after apply)

+                                   items {
+                                       key  = (known after apply)
+                                       mode = (known after apply)
+                                       path = (known after apply)
                                    }
                                }

+                               service_account_token {
+                                   audience           = (known after apply)
+                                   expiration_seconds = (known after apply)
+                                   path               = (known after apply)
                                }
                            }
                        }

+                       quobyte {
+                           group     = (known after apply)
+                           read_only = (known after apply)
+                           registry  = (known after apply)
+                           user      = (known after apply)
+                           volume    = (known after apply)
                        }

+                       rbd {
+                           ceph_monitors = (known after apply)
+                           fs_type       = (known after apply)
+                           keyring       = (known after apply)
+                           rados_user    = (known after apply)
+                           rbd_image     = (known after apply)
+                           rbd_pool      = (known after apply)
+                           read_only     = (known after apply)

+                           secret_ref {
+                               name      = (known after apply)
+                               namespace = (known after apply)
                            }
                        }

+                       secret {
+                           default_mode = (known after apply)
+                           optional     = (known after apply)
+                           secret_name  = (known after apply)

+                           items {
+                               key  = (known after apply)
+                               mode = (known after apply)
+                               path = (known after apply)
                            }
                        }

+                       vsphere_volume {
+                           fs_type     = (known after apply)
+                           volume_path = (known after apply)
                        }
                    }
                }
            }
        }
    }

  # module.argocd.module.argocd_redis.module.argocd_redis[0].kubernetes_role.redis_ha_role will be created
+   resource "kubernetes_role" "redis_ha_role" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/component" = "redis"
+               "app.kubernetes.io/name"      = "argocd-redis"
+               "app.kubernetes.io/part-of"   = "argocd"
            }
+           name             = "argocd-redis"
+           namespace        = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       rule {
+           api_groups = [
+               "",
            ]
+           resources  = [
+               "endpoints",
            ]
+           verbs      = [
+               "get",
            ]
        }
    }

  # module.argocd.module.argocd_redis.module.argocd_redis[0].kubernetes_role_binding.redis_ha_role_binding will be created
+   resource "kubernetes_role_binding" "redis_ha_role_binding" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/component" = "redis"
+               "app.kubernetes.io/name"      = "argocd-redis"
+               "app.kubernetes.io/part-of"   = "argocd"
            }
+           name             = "argocd-redis"
+           namespace        = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       role_ref {
+           api_group = "rbac.authorization.k8s.io"
+           kind      = "Role"
+           name      = "argocd-redis"
        }

+       subject {
+           api_group = (known after apply)
+           kind      = "ServiceAccount"
+           name      = "argocd-redis"
+           namespace = "kube-argocd"
        }
    }

  # module.argocd.module.argocd_redis.module.argocd_redis[0].kubernetes_service.argocd_redis will be created
+   resource "kubernetes_service" "argocd_redis" {
+       id                     = (known after apply)
+       status                 = (known after apply)
+       wait_for_load_balancer = true

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/component" = "redis"
+               "app.kubernetes.io/name"      = "argocd-redis"
+               "app.kubernetes.io/part-of"   = "argocd"
            }
+           name             = "argocd-redis"
+           namespace        = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           cluster_ip                  = (known after apply)
+           external_traffic_policy     = (known after apply)
+           health_check_node_port      = (known after apply)
+           publish_not_ready_addresses = false
+           selector                    = {
+               "app.kubernetes.io/name" = "argocd-redis"
            }
+           session_affinity            = "None"
+           type                        = "ClusterIP"

+           port {
+               name        = "tcp-redis"
+               node_port   = (known after apply)
+               port        = 6379
+               protocol    = "TCP"
+               target_port = "6379"
            }
        }
    }

  # module.argocd.module.argocd_redis.module.argocd_redis[0].kubernetes_service_account.redis_ha_service_account will be created
+   resource "kubernetes_service_account" "redis_ha_service_account" {
+       automount_service_account_token = true
+       default_secret_name             = (known after apply)
+       id                              = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/component" = "redis"
+               "app.kubernetes.io/name"      = "argocd-redis"
+               "app.kubernetes.io/part-of"   = "argocd"
            }
+           name             = "argocd-redis"
+           namespace        = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 29 to add, 0 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
